Based on Final Project Advice #2 in How to Win a Data Science Competition: Learn from Top Kagglers.
In this benchmark for the each shop/item pair our predictions are just monthly sales from the previous month, i.e. October 2015.
The most important step is correctly aggregating daily data and constructing monthly sales data frame. Fill NaNs with zeros and clip the values into [0,20] range. If you do it correctly, you'll get precisely 1.16777 on the public leaderboard.

In [1]:
# import required libraries
import pandas as pd
import numpy as np

In [2]:
# load train data.
train_data = pd.read_csv("data/sales_train_v2.csv")

In [3]:
# convert date column into datetime and then add date.year, date.month and date.day columns in train_data
train_data['date'] = pd.to_datetime(train_data['date'], format='%d.%m.%Y')
train_data['date_day'] = train_data.date.dt.day
train_data['date_month'] = train_data.date.dt.month
train_data['date_year'] = train_data.date.dt.year
train_data.head()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,date_day,date_month,date_year
0,2013-01-02,0,59,22154,999.00,1.0,2,1,2013
1,2013-01-03,0,25,2552,899.00,1.0,3,1,2013
2,2013-01-05,0,25,2552,899.00,-1.0,5,1,2013
3,2013-01-06,0,25,2554,1709.05,1.0,6,1,2013
4,2013-01-15,0,25,2555,1099.00,1.0,15,1,2013

In [4]:
# select all examples in 10/2015
data_Oct15 = train_data[(train_data.date_year==2015) & (train_data.date_month==10)]
data_Oct15.shape

(53514, 9)

In [9]:
# group data_Oct15 by 'shop_id' and 'item_id' two columns and then sum 'item_cnt_day'. In order to get 
# the sales for each shop/item pair in data_Oct15
shop_item_revenue_sum = data_Oct15.groupby(['shop_id','item_id'])['item_cnt_day'].sum().reset_index()

In [10]:
shop_item_revenue_sum.head()

   shop_id  item_id  item_cnt_day
0        2       31           1.0
1        2      486           3.0
2        2      787           1.0
3        2      794           1.0
4        2      968           1.0

In [11]:
# load test data
test_data = pd.read_csv("data/test.csv")
test_data.shape

(214200, 3)

In [12]:
test_data.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [13]:
# merge test_data and shop_item_revenue_sum based on 'shop_id' and 'item_id' and only left the records in test_data
# if test_data dosen't exist the shop/item pair which is in shop_item_revenue_sum, that record is NaN.
mergedStuff = pd.merge(test_data, shop_item_revenue_sum, on=['shop_id','item_id'], how='left')

In [14]:
mergedStuff.head()

   ID  shop_id  item_id  item_cnt_day
0   0        5     5037           NaN
1   1        5     5320           NaN
2   2        5     5233           1.0
3   3        5     5232           NaN
4   4        5     5268           NaN

In [15]:
# fillna with 0.0
mergedStuff = mergedStuff.fillna(0.0)

In [16]:
# clip the values of 'item_cnt_day' into [0,20] range
mergedStuff['item_cnt_day'] = mergedStuff['item_cnt_day'].clip(0,20)

In [17]:
# prepare ID for submission
test_ID = test_data.ID

In [18]:
# get submission.csv and get 1.16777 score in public leaderboard
my_submission = pd.DataFrame({'ID':test_ID,'item_cnt_month':mergedStuff.item_cnt_day})
my_submission.to_csv("submission.csv", index=False)